app/Controllers/Home.php

SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        echo view('/inc/header.php');
        $data['users'] = $this->user->orderBy('id', 'desc')->paginate(3, 'group1');

INSERT INTO `users` (`username`, `email`) VALUES ('emp03', 'emp03@gmail.com')
---
    public function saveUser() {
        $username = $this->request->getVar('username');
        $email = $this->request->getVar('email');
        $this->user->save(['username' => $username, 'email' => $email]);

DELETE FROM `users`
WHERE `id` IN ('12')
---
    public function deleteMultiUser() {
        $ids = $this->request->getVar('ids');
        for($count = 0; $count < count($ids); $count++) {
            $this->user->delete($ids[$count]);